app/controllers/pages_controller.rb

SELECT  "claims".* FROM "claims" WHERE "claims"."active" = ? LIMIT ?  [["active", "t"], ["LIMIT", 3]]
---
  def home
    @claims = Claim.where(active: true).limit(3)