app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? ORDER BY "reservations"."start_date" ASC  [["user_id", 1]]
---
  def your_trips
    @trips = current_user.reservations.order(start_date: :asc)